chapters/emacs.org
# -*- org-link-file-path-type: relative; -*-
#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:t arch:headline
#+options: author:t broken-links:nil c:nil creator:nil
#+options: d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:nil stat:t tags:t tasks:t tex:t
#+options: timestamp:t title:t toc:t todo:t |:t
#+title: Emacs
#+date: <2023-02-03 Fri>
#+author: Britt Anderson
#+email: britt@uwaterloo.ca
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.2 (Org mode 9.6-pre)
#+bibliography: /home/britt/gitRepos/Intro2Computing4Psychology/chapters/i2c4p.bib
#+cite_export: csl assets/chicago-note-bibliography-16th-edition.csl

* Goal
  Introduce emacs and the rudiments of its use. We will build on these basics as we work through our additional exercises in coding and programming experiments and writing reports. 
* What is Emacs
  Emacs is the tool we will be leveraging to produce our reproducible research report, but it is much more. It is a highly extensible text editor that can make your life much easier through its auxilliary functions and capacities. 
* Emacs is a text editor
  Emacs began in some form in the early 1970s [fn:1]. It has been continually developed for 50 years and quite a bit of humor and myth has settled about it [fn:2]. Some people joke that it is an operating system masquerading as a text editor. Many people argue that it is overly complex and overly engineered, but it truly allows one to do a great deal within a single interface and a single environment, and I introduce it because I love it, but more importantly, because I think it is one of the easiest way to become functional with some of the key tools that allow you to generate a reproducible report [fn:3]. As confirmation of its versatility this whole book is written and assembled using emacs org mode (see [[info:org#Publishing][org#Publishing]] - if you open this link in emacs (from the .org file) using =C-c C-o= it will take you to the "info" page, which is includes the emacs documentation).
* Emacs Basics

As you read the rest of this file you may want to also skim the following video where I try to explain in more detail how the key commands and the Emacs interface works at a basic level.

#+begin_export html
<iframe src="https://player.vimeo.com/video/455628993?h=5f55d099d6" width="640" height="361" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/455628993">Eb : Beginning With Emacs</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
#+end_export

** Modifier Keys
   Your modifier keys may depend on your keyboard and operating system. Don't like what they are? [[https://www.x.org/releases/current/doc/man/man1/xmodmap.1.xhtml][Remap them]]. You use these simultaneously with other keys to invoke commands without using your mouse or menus. For example, to open a file you ~C-x C-f~. This means that you hold down the control key and press 'x'. Then you let up on both keys, press control and then simultaneously 'f' and let up on both. You are then prompted in the /minibuffer/ with a menu for the name and location of the new file. You can navigate the mini-buffer by using backspace to delete and tab to move forward. 
*** Ctrl
    This is usually the <ctrl> key. Found on lower left (and sometimes also on lower right) of most keyboards.
*** Meta
    On windows and macs this is usually the <alt> key. Sometimes it is mapped to the super key, which has the windows logo or the curly square of macs. 
** What Can You Do With Emacs
   1. Write code
   2. Execute code
   3. Execute code within the confines of a document
   4. Export the document as a webpage or pdf.
   5. Read and annotate pdfs.
   6. Manage your email.
   7. Securely encrypt/decrypt and sign emails.
   8. Edit the names of files in your directories.
   9. Compress and decompress files.
   10. Manage your bibliography.
   11. Create citations.
   12. Interface with the ~git~ version control system.
   13. Talk remotely to servers. Copy and move files between computers as if the were merely separate directories on your own machine.
   14. Manage a knowledge data base in plain text.
   15. Keep your calendar, journal, agenda, and to-do list integrated.
   16. Take notes in a rapid outline fashion.

   #+Caption: A brief video exploring some of the above opportunities of Emacs
   #+begin_export html
   <iframe src="https://player.vimeo.com/video/455641662?h=516b5b0020" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/455641662">Emacs Show and Tell</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>

#+end_export
** Emacs Takes a Long Time to Learn
   I learn new things in emacs everyday. Don't expect to do all those things at the beginning. You will just frustrate yourself. Pick some small things that you do regularly and try to learn how to do that in emacs. The rest will grow naturally as your comfort expands and you tackle new use cases. 
*** First Things First
    Learn the basics. Take the Emacs tutorial  ~Ctrl-h t~ (aka =C-h t=). Consult the Psychotherapist when needed (under help menu). Play a game - try ~M-x tetris~ .
** Emacs is highly customizable
   Just like linux distributions have package managers so does emacs. Usually your emacs customizations will be found in a /hidden/ directory (starts with a dot ('.') in your home directory. For example, =/home/britt/.emacs.d/=
