book/emacs.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2023-04-23 Sun 11:52 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Emacs</title>
<meta name="author" content="Britt Anderson" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Emacs</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#orgbf923df">1. Goal</a></li>
<li><a href="#org4d57580">2. What is Emacs</a></li>
<li><a href="#org682fd3b">3. Emacs is a text editor</a></li>
<li><a href="#org63e1804">4. Emacs Basics</a>
<ul>
<li><a href="#orgcc5c1bf">4.1. Modifier Keys</a>
<ul>
<li><a href="#orgd35c8e5">4.1.1. Ctrl</a></li>
<li><a href="#org4d2366d">4.1.2. Meta</a></li>
</ul>
</li>
<li><a href="#orgf2f6ba9">4.2. What Can You Do With Emacs</a></li>
<li><a href="#org676346b">4.3. Emacs Takes a Long Time to Learn</a>
<ul>
<li><a href="#orge4faaec">4.3.1. First Things First</a></li>
</ul>
</li>
<li><a href="#org719bc93">4.4. Emacs is highly customizable</a>
<ul>
<li><a href="#orgdc8e875">4.4.1. Where is your "init" file</a></li>
<li><a href="#org482c249">4.4.2. The init.el file and packages</a></li>
<li><a href="#orgdb11927">4.4.3. Additional Tools for Package Management with Emacs</a></li>
<li><a href="#orgb2eab70">4.4.4. Program Your Editor</a></li>
<li><a href="#orga2e91ef">4.4.5. Orgmode</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgd6c2a73">5. Emacs Activities and Assessments</a>
<ul>
<li><a href="#org17043da">5.1. Task</a></li>
<li><a href="#orgb6bacc9">5.2. General Instructions</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgbf923df" class="outline-2">
<h2 id="orgbf923df"><span class="section-number-2">1.</span> Goal</h2>
<div class="outline-text-2" id="text-1">
<p>
Introduce emacs and the rudiments of its use. We will build on these basics as we work through our additional exercises in coding and programming experiments and writing reports. 
</p>
</div>
</div>
<div id="outline-container-org4d57580" class="outline-2">
<h2 id="org4d57580"><span class="section-number-2">2.</span> What is Emacs</h2>
<div class="outline-text-2" id="text-2">
<p>
Emacs is the tool we will be leveraging to produce our reproducible research report, but it is much more. It is a highly extensible text editor that can make your life much easier through its auxilliary functions and capacities. 
</p>
</div>
</div>
<div id="outline-container-org682fd3b" class="outline-2">
<h2 id="org682fd3b"><span class="section-number-2">3.</span> Emacs is a text editor</h2>
<div class="outline-text-2" id="text-3">
<p>
Emacs began in some form in the early 1970s <sup><a id="fnr.1" class="footref" href="#fn.1" role="doc-backlink">1</a></sup>. It has been continually developed for 50 years and quite a bit of humor and myth has settled about it <sup><a id="fnr.2" class="footref" href="#fn.2" role="doc-backlink">2</a></sup>. Some people joke that it is an operating system masquerading as a text editor. Many people argue that it is overly complex and overly engineered, but it truly allows one to do a great deal within a single interface and a single environment, and I introduce it because I love it, but more importantly, because I think it is one of the easiest way to become functional with some of the key tools that allow you to generate a reproducible report <sup><a id="fnr.3" class="footref" href="#fn.3" role="doc-backlink">3</a></sup>. As confirmation of its versatility this whole book is written and assembled using emacs org mode (see <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Publishing">org#Publishing</a> - if you open this link in emacs (from the .org file) using <code>C-c C-o</code> it will take you to the "info" page, which is includes the emacs documentation).
</p>
</div>
</div>
<div id="outline-container-org63e1804" class="outline-2">
<h2 id="org63e1804"><span class="section-number-2">4.</span> Emacs Basics</h2>
<div class="outline-text-2" id="text-4">
<p>
As you read the rest of this file you may want to also skim the following video where I try to explain in more detail how the key commands and the Emacs interface works at a basic level.
</p>

<iframe src="https://player.vimeo.com/video/455628993?h=5f55d099d6" width="640" height="361" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/455628993">Eb : Beginning With Emacs</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
</div>

<div id="outline-container-orgcc5c1bf" class="outline-3">
<h3 id="orgcc5c1bf"><span class="section-number-3">4.1.</span> Modifier Keys</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Your modifier keys may depend on your keyboard and operating system. Don't like what they are? <a href="https://www.x.org/releases/current/doc/man/man1/xmodmap.1.xhtml">Remap them</a>. You use these simultaneously with other keys to invoke commands without using your mouse or menus. For example, to open a file you <code>C-x C-f</code>. This means that you hold down the control key and press 'x'. Then you let up on both keys, press control and then simultaneously 'f' and let up on both. You are then prompted in the <i>minibuffer</i> with a menu for the name and location of the new file. You can navigate the mini-buffer by using backspace to delete and tab to move forward. 
</p>
</div>
<div id="outline-container-orgd35c8e5" class="outline-4">
<h4 id="orgd35c8e5"><span class="section-number-4">4.1.1.</span> Ctrl</h4>
<div class="outline-text-4" id="text-4-1-1">
<p>
This is usually the &lt;ctrl&gt; key. Found on lower left (and sometimes also on lower right) of most keyboards.
</p>
</div>
</div>
<div id="outline-container-org4d2366d" class="outline-4">
<h4 id="org4d2366d"><span class="section-number-4">4.1.2.</span> Meta</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
On windows and macs this is usually the &lt;alt&gt; key. Sometimes it is mapped to the super key, which has the windows logo or the curly square of macs. 
</p>
</div>
</div>
</div>
<div id="outline-container-orgf2f6ba9" class="outline-3">
<h3 id="orgf2f6ba9"><span class="section-number-3">4.2.</span> What Can You Do With Emacs</h3>
<div class="outline-text-3" id="text-4-2">
<ol class="org-ol">
<li>Write code</li>
<li>Execute code</li>
<li>Execute code within the confines of a document</li>
<li>Export the document as a webpage or pdf.</li>
<li>Read and annotate pdfs.</li>
<li>Manage your email.</li>
<li>Securely encrypt/decrypt and sign emails.</li>
<li>Edit the names of files in your directories.</li>
<li>Compress and decompress files.</li>
<li>Manage your bibliography.</li>
<li>Create citations.</li>
<li>Interface with the <code>git</code> version control system.</li>
<li>Talk remotely to servers. Copy and move files between computers as if the were merely separate directories on your own machine.</li>
<li>Manage a knowledge data base in plain text.</li>
<li>Keep your calendar, journal, agenda, and to-do list integrated.</li>
<li>Take notes in a rapid outline fashion.</li>
</ol>

   <iframe src="https://player.vimeo.com/video/455641662?h=516b5b0020" width="640" height="360" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe>
<p><a href="https://vimeo.com/455641662">Emacs Show and Tell</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
</div>
</div>
<div id="outline-container-org676346b" class="outline-3">
<h3 id="org676346b"><span class="section-number-3">4.3.</span> Emacs Takes a Long Time to Learn</h3>
<div class="outline-text-3" id="text-4-3">
<p>
I learn new things in emacs everyday. Don't expect to do all those things at the beginning. You will just frustrate yourself. Pick some small things that you do regularly and try to learn how to do that in emacs. The rest will grow naturally as your comfort expands and you tackle new use cases. 
</p>
</div>
<div id="outline-container-orge4faaec" class="outline-4">
<h4 id="orge4faaec"><span class="section-number-4">4.3.1.</span> First Things First</h4>
<div class="outline-text-4" id="text-4-3-1">
<p>
Learn the basics. Take the Emacs tutorial  <code>Ctrl-h t</code> (aka <code>C-h t</code>). Consult the Psychotherapist when needed (under help menu). Play a game - try <code>M-x tetris</code> .
</p>
</div>
</div>
</div>
<div id="outline-container-org719bc93" class="outline-3">
<h3 id="org719bc93"><span class="section-number-3">4.4.</span> Emacs is highly customizable</h3>
<div class="outline-text-3" id="text-4-4">
<p>
Just like linux distributions have package managers so does emacs. Usually your emacs customizations will be found in a <i>hidden</i> directory (starts with a dot ('.') in your home directory. For example, <code>/home/britt/.emacs.d/</code>
</p>
</div>
