chapters/emacs.org
*** Where is your "init" file
    Emacs tries to find an initialization file to see your customizations and what, if any, extra packages you may have installed. There are multiple places where it looks, and we want it to look in the right one. 
    Do ~C-x d~. This will display your current directory. The first line shows you where you are. Move up or down as needed to get to your home directory. Look for a file called ~.emacs~. Navigate to it by ~C-n~ and ~C-p~ to move up and down. When you find it and the cursor is on it. Type a capital ~D~. Then confirm the delete. Then ~C-x d~ and tab to =~/.emacs.d/=. Type a plus sign ~+~. For the name of the new file type ~init.el.~
*** The init.el file and packages

#+begin_export html
<div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810618444?h=6e9557e0c4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810618444">Emacs Package Management 1</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>An short overview of what file you need to access to establish your packages for Emacs</p>
#+end_export

 Emacs has it's own package system that allows you to greatly expand its functionality. You can learn more by reading the info file =C-h i=. If for some reason your info files are missing see this Stackoverflow question for hints on how to install [fn:4]. Many packages could be installed through the =apt= methods, but it is better not to mix and match package systems. Since there may well be packages you will eventually want that are not built by xubuntu you should probably use packages from the emacs system. The big package warehouse that most emacs users rely on is called "melpa". Here is how to get a basic package database available.
    #+begin_src emacslisp :eval never :exports code
    (require 'package)
    (add-to-list 'package-archives '("melpa" ."http://melpa.org/packages/") t)
    (package-initialize)
    #+end_src
    Now we can look for packages by running ~M-x package-list-packages~
*** Additional Tools for Package Management with Emacs
    The easiest way to get started with Emacs packages is to install packages via the ~package-list-packages~. In that pane that opens up you can search for a package (using ~C-s~) and then type an "i" to install it.


#+begin_export html
   <div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810618692?h=6a31a1bea5" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810618692">Emacs Packagement - using use-package</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A demo of use-package for packages and configuration in Emacs</p> 
#+end_export
    
    As you become more comfortable with Emacs, if in fact you ever do, you might want to consider other ways to manage your package. I quite like [[https://suvratapte.com/configuring-emacs-from-scratch-use-package/][use-package]] as it allowed me to write down what packages and customizations I was using in a single place. Then I could use that file on a new computer to fairly easily get the same set-up. Here is an example of how one might use the =use-package= system:

    #+begin_src emacslisp :eval never :exports code
    (use-package elpy
    :ensure t
    :init (elpy-enable))
     
    (use-package ess
    :ensure t
    )
    #+end_src

    If you become even more expert you may want to manage and compile your emacs packages directly from source. For that you might want to manage packages with [[https://github.com/radian-software/straight.el][straight.el]]. This is definitely a more advanced package management system, and should wait until you feel comfortable using Emacs.

    Lastly, there are Emacs bundles where someone has decided to create a system that uses Emacs and contains an already configured selection of emacs packages that play well together. Many people find these a nice help when getting started. If you decide you want to keep trying emacs after this course, but find it hard to get started, then one of these two options ([[https://www.spacemacs.org/][spacemacs]] ; [[https://github.com/doomemacs/doomemacs][doomemacs]] ) might be worth a look. If you are the kind of person who likes books for learning, check out [[https://www.masteringemacs.org/][Mastering Emacs]]. 
*** Program Your Editor
    Emacs can be programmed with elisp code, it's own [[https://en.wikipedia.org/wiki/Lisp_(programming_language)][lisp]]. You can actually change the functions of your editor while using it. Usually, you don't really need to know elisp. You just need to have the confidence to cut and paste to the right location, usually you =init.el= file. 
**** An example: Turn off the tool bar.
     - To search for functions you can use the help ~C-h-f~. This will allow you to search for functions. Try the keyword menu and tab and see if you come across a likely contender (~menu-bar-showhide-tool-bar-menu-customize-disable~).
     - Navigate to the scratch buffer. Put that function in parantheses. Move to the end. Type ~C-x C-e~. Did your tool bar go away?
*** [[info:org#Top][Orgmode]]
    1. What is it? About the best thing ever.
    2. Make an outline. Keep a calendar. Add code to your documents. Make links. Include images.
    3. Practice now:
    Where is the help, remember? ~C-h i~
    1. Learn to use the short cuts to open, save, and so on. That is one of the powers of the command line and similar style tools. Enhance your productivity and control. 
    2. Create an outline.
    3. Create a link
    4. Insert an image
    5. Export as a web page.
    6. What would you need to export a pdf?
       You will probably need some extra packages from Ubuntu to do this. Emacs will rely on external packages to compile the "LaTeX" intermediate to a pdf. 
       Try installing ~texlive-latex-base texlive-latex-extra~. If that doesn't work, repeat with ~texlive-latex-recommended~. If that doesn't fix the problem go with ~texlive-full~. This is big package. Be patient.
* Emacs Activities and Assessments
** Task
  Create and submit an .org file edited in emacs. We will recreat the original [[file:rstudio.org::*First Rmd Assessment][First Rmd Assessment]] using this alternative markup syntax. 
