book/emacs.html
<div id="outline-container-orgdc8e875" class="outline-4">
<h4 id="orgdc8e875"><span class="section-number-4">4.4.1.</span> Where is your "init" file</h4>
<div class="outline-text-4" id="text-4-4-1">
<p>
Emacs tries to find an initialization file to see your customizations and what, if any, extra packages you may have installed. There are multiple places where it looks, and we want it to look in the right one. 
Do <code>C-x d</code>. This will display your current directory. The first line shows you where you are. Move up or down as needed to get to your home directory. Look for a file called <code>.emacs</code>. Navigate to it by <code>C-n</code> and <code>C-p</code> to move up and down. When you find it and the cursor is on it. Type a capital <code>D</code>. Then confirm the delete. Then <code>C-x d</code> and tab to <code>~/.emacs.d/</code>. Type a plus sign <code>+</code>. For the name of the new file type <code>init.el.</code>
</p>
</div>
</div>
<div id="outline-container-org482c249" class="outline-4">
<h4 id="org482c249"><span class="section-number-4">4.4.2.</span> The init.el file and packages</h4>
<div class="outline-text-4" id="text-4-4-2">
<div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810618444?h=6e9557e0c4" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810618444">Emacs Package Management 1</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A short overview of what file you need to access to establish your packages for Emacs</p>

<p>
Emacs has it's own package system that allows you to greatly expand its functionality. You can learn more by reading the info file <code>C-h i</code>. If for some reason your info files are missing see this Stackoverflow question for hints on how to install <sup><a id="fnr.4" class="footref" href="#fn.4" role="doc-backlink">4</a></sup>. Many packages could be installed through the <code>apt</code> methods, but it is better not to mix and match package systems. Since there may well be packages you will eventually want that are not built by xubuntu you should probably use packages from the emacs system. The big package warehouse that most emacs users rely on is called "melpa". Here is how to get a basic package database available.
</p>
<div class="org-src-container">
<pre class="src src-emacslisp">(require 'package)
(add-to-list 'package-archives '("melpa" ."http://melpa.org/packages/") t)
(package-initialize)
</pre>
</div>
<p>
Now we can look for packages by running <code>M-x package-list-packages</code>
</p>
</div>
</div>
<div id="outline-container-orgdb11927" class="outline-4">
<h4 id="orgdb11927"><span class="section-number-4">4.4.3.</span> Additional Tools for Package Management with Emacs</h4>
<div class="outline-text-4" id="text-4-4-3">
<p>
The easiest way to get started with Emacs packages is to install packages via the <code>package-list-packages</code>. In that pane that opens up you can search for a package (using <code>C-s</code>) and then type an "i" to install it.
</p>


   <div style="padding:65.03% 0 0 0;position:relative;"><iframe src="https://player.vimeo.com/video/810618692?h=6a31a1bea5" style="position:absolute;top:0;left:0;width:100%;height:100%;" frameborder="0" allow="autoplay; fullscreen; picture-in-picture" allowfullscreen></iframe></div><script src="https://player.vimeo.com/api/player.js"></script>
<p><a href="https://vimeo.com/810618692">Emacs Packagement - using use-package</a> from <a href="https://vimeo.com/epistemic">Britt Anderson</a> on <a href="https://vimeo.com">Vimeo</a>.</p>
<p>A demo of use-package for packages and configuration in Emacs</p> 

<p>
As you become more comfortable with Emacs, if in fact you ever do, you might want to consider other ways to manage your package. I quite like <a href="https://suvratapte.com/configuring-emacs-from-scratch-use-package/">use-package</a> as it allowed me to write down what packages and customizations I was using in a single place. Then I could use that file on a new computer to fairly easily get the same set-up. Here is an example of how one might use the <code>use-package</code> system:
</p>

<div class="org-src-container">
<pre class="src src-emacslisp">(use-package elpy
:ensure t
:init (elpy-enable))

(use-package ess
:ensure t
)
</pre>
</div>

<p>
If you become even more expert you may want to manage and compile your emacs packages directly from source. For that you might want to manage packages with <a href="https://github.com/radian-software/straight.el">straight.el</a>. This is definitely a more advanced package management system, and should wait until you feel comfortable using Emacs.
</p>

<p>
Lastly, there are Emacs bundles where someone has decided to create a system that uses Emacs and contains an already configured selection of emacs packages that play well together. Many people find these a nice help when getting started. If you decide you want to keep trying emacs after this course, but find it hard to get started, then one of these two options (<a href="https://www.spacemacs.org/">spacemacs</a> ; <a href="https://github.com/doomemacs/doomemacs">doomemacs</a> ) might be worth a look. If you are the kind of person who likes books for learning, check out <a href="https://www.masteringemacs.org/">Mastering Emacs</a>. 
</p>
</div>
</div>
<div id="outline-container-orgb2eab70" class="outline-4">
<h4 id="orgb2eab70"><span class="section-number-4">4.4.4.</span> Program Your Editor</h4>
<div class="outline-text-4" id="text-4-4-4">
<p>
Emacs can be programmed with elisp code, it's own <a href="https://en.wikipedia.org/wiki/Lisp_(programming_language)">lisp</a>. You can actually change the functions of your editor while using it. Usually, you don't really need to know elisp. You just need to have the confidence to cut and paste to the right location, usually your <code>init.el</code> file. 
</p>
</div>
<ol class="org-ol">
<li><a id="org3e3b4fb"></a>An example: Turn off the tool bar.<br />
<div class="outline-text-5" id="text-4-4-4-1">
<ul class="org-ul">
<li>To search for functions you can use the help <code>C-h-f</code>. This will allow you to search for functions. Try the keyword menu and tab and see if you come across a likely contender (<code>menu-bar-showhide-tool-bar-menu-customize-disable</code>).</li>
<li>Navigate to the scratch buffer. Put that function in parantheses. Move to the end. Type <code>C-x C-e</code>. Did your tool bar go away?</li>
</ul>
</div>
</li>
</ol>
</div>
<div id="outline-container-orga2e91ef" class="outline-4">
<h4 id="orga2e91ef"><span class="section-number-4">4.4.5.</span> <a href="https://www.gnu.org/software/emacs/manual/html_mono/org.html#Top">Orgmode</a></h4>
<div class="outline-text-4" id="text-4-4-5">
<ol class="org-ol">
<li>What is it? About the best thing ever.</li>
<li>Make an outline. Keep a calendar. Add code to your documents. Make links. Include images.</li>
<li>Practice now:</li>
</ol>
<p>
Where is the help, remember? <code>C-h i</code>
</p>
<ol class="org-ol">
<li>Learn to use the short cuts to open, save, and so on. That is one of the powers of the command line and similar style tools. Enhance your productivity and control.</li>
<li>Create an outline.</li>
<li>Create a link</li>
<li>Insert an image</li>
<li>Export as a web page.</li>
<li>What would you need to export a pdf?
You will probably need some extra packages from Ubuntu to do this. Emacs will rely on external packages to compile the "LaTeX" intermediate to a pdf. 
Try installing <code>texlive-latex-base texlive-latex-extra</code>. If that doesn't work, repeat with <code>texlive-latex-recommended</code>. If that doesn't fix the problem go with <code>texlive-full</code>. This is big package. Be patient.</li>
</ol>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd6c2a73" class="outline-2">
<h2 id="orgd6c2a73"><span class="section-number-2">5.</span> Emacs Activities and Assessments</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-org17043da" class="outline-3">
<h3 id="org17043da"><span class="section-number-3">5.1.</span> Task</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Create and submit an .org file edited in emacs. We will recreat the original <a href="rstudio.html#org2e0207c">First Rmd Assessment</a> using this alternative markup syntax. 
</p>
</div>
</div>
