chapters/emacs.org
** General Instructions
  1. Create an org file in emacs using your name as the file name.
  2. Create a major heading for you identifying information and put your name in bold and your student id in italics.
  3. Create a functioning link to a favorite website relevant to science or research.
  4. Create an inline link to an image from the web that will appear in your exported version.
  5. Verify that when you export your org file =C-c C-e h h= to html that you can open your html output and that it shows the properly configured output.


* Footnotes

[fn:1] https://www.emacswiki.org/emacs/EmacsHistory
[fn:2] https://xkcd.com/378/
[fn:3] https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.2006930
[fn:4] https://emacs.stackexchange.com/questions/48211/emacs-manuals-are-missing-on-debian-ubuntu/48214#48214 To get this to work I enabled the non-free icon on the repositories, did  ~sudo apt install emacs-common-non-dfsg~ for all the documentation, and then ran as the super user the command to update the info directories. 


