book/emacs.html
<div id="outline-container-orgb6bacc9" class="outline-3">
<h3 id="orgb6bacc9"><span class="section-number-3">5.2.</span> General Instructions</h3>
<div class="outline-text-3" id="text-5-2">
<ol class="org-ol">
<li>Create an org file in emacs using your name as the file name.</li>
<li>Create a major heading for you identifying information and put your name in bold and your student id in italics.</li>
<li>Create a functioning link to a favorite website relevant to science or research.</li>
<li>Create an inline link to an image from the web that will appear in your exported version.</li>
<li>Verify that when you export your org file <code>C-c C-e h h</code> to html that you can open your html output and that it shows the properly configured output.</li>
</ol>
</div>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1" role="doc-backlink">1</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://www.emacswiki.org/emacs/EmacsHistory">https://www.emacswiki.org/emacs/EmacsHistory</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2" role="doc-backlink">2</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://xkcd.com/378/">https://xkcd.com/378/</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3" role="doc-backlink">3</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.2006930">https://journals.plos.org/plosbiology/article?id=10.1371/journal.pbio.2006930</a>
</p></div></div>

<div class="footdef"><sup><a id="fn.4" class="footnum" href="#fnr.4" role="doc-backlink">4</a></sup> <div class="footpara" role="doc-footnote"><p class="footpara">
<a href="https://emacs.stackexchange.com/questions/48211/emacs-manuals-are-missing-on-debian-ubuntu/48214#48214">https://emacs.stackexchange.com/questions/48211/emacs-manuals-are-missing-on-debian-ubuntu/48214#48214</a> To get this to work I enabled the non-free icon on the repositories, did  <code>sudo apt install emacs-common-non-dfsg</code> for all the documentation, and then ran as the super user the command to update the info directories. 
</p></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="date">Date: 2023-02-03 Fri 00:00</p>
<p class="author">Author: Britt Anderson</p>
<p class="date">Created: 2023-04-23 Sun 11:52</p>
<p class="validation"><a href="https://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>